Workspace/Encuesta-Projekt/app/views/surveys/edit.html.erb


    <% Surveytype.all.each do |surveytype| %>
---
SELECT "surveytypes".* FROM "surveytypes"


    <% Question.find_all_by_survey_id(@survey.id).each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 9)


    	<% Answer.find_all_by_question_id(question.id).each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 1)