Workspace/Encuesta-Projekt/app/views/answers/new.html.erb

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 18) LIMIT 1
---
<h1>Neue Antwort zu Frage: <%=render :text => Question.find(params[:question_id]).questiontext%>

SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 25)
---
  			<ul>
  				<% Answer.find_all_by_question_id(params[:question_id]).each do |answer|%>