trunk/Workspace/Encuesta-Projekt/app/views/questions/edit.html.erb

SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 5) LIMIT 1
---
    <table>
        <% Answer.find_all_by_question_id(@question.id).each do |answer| %>

SELECT "answertypes".* FROM "answertypes"
---
<div class="field">
    <% Answertype.all.each do |answertype| %>