trunk/Workspace/Encuesta-Projekt/app/views/questions/new.html.erb

  <div class="field">
    <% Answertype.all.each do |answertype| %>
---
SELECT "answertypes".* FROM "answertypes"