trunk/Workspace/Encuesta-Projekt/app/views/users/show.html.erb

SELECT "surveys".* FROM "surveys" WHERE ("surveys".user_id = 1) ORDER BY surveys.created_at DESC
SELECT COUNT(*) FROM "surveys" WHERE ("surveys".user_id = 1)
---
      </h1>
      <% unless @user.surveys.empty? %>