Workspace/Encuesta-Projekt/app/views/questions/edit.html.erb

    <table>
        <% @counter = Answer.find_all_by_question_id(@question.id).count%>
---
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 5) LIMIT 1

<div class="field">
    <% Answertype.all.each do |answertype| %>
---
SELECT "answertypes".* FROM "answertypes"