Workspace/Encuesta-Projekt/app/views/forms/new.html.erb

SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 2) ORDER BY surveys.created_at DESC LIMIT 1
---

<%survey = Survey.find(params[:survey_id]) %>

SELECT "surveytypes".* FROM "surveytypes" WHERE ("surveytypes"."id" = 2) LIMIT 1
---

    <% surveytype = Surveytype.find(survey.surveytype.id)%>

SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 2)
---

    <% Question.find_all_by_survey_id(survey.id).each do |question| %>

SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 5)
---
    <br>
    	<% Answer.find_all_by_question_id(question.id).each do |answer| %>