trunk/Workspace/Encuesta-Projekt/app/views/pages/help.html.erb

SELECT "users".* FROM "users"
---

<%= collection_select(:user, :user_id, User.all, :id, :login) %>

SELECT "surveytypes".* FROM "surveytypes"
---
  <% end %>
  <% Surveytype.all.each do |surveytype| %>

SELECT "surveys".* FROM "surveys" ORDER BY surveys.created_at DESC
---

<% Survey.all.each do |survey| %>