trunk/Workspace/Encuesta-Projekt/app/views/evaluation/show.html.erb

SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 17)
---

  <% q = Question.find_all_by_survey_id(@survey.id) %>

SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 26)
---

        <% a = Answer.find_all_by_question_id(question.id) %></th>

SELECT "forms".* FROM "forms" WHERE ("forms"."survey_id" = 17)
SELECT "user_answers".* FROM "user_answers" WHERE ("user_answers".form_id = 87) AND ("user_answers"."answer_id" = 65)
---
	      				<% @usranswer = 0%>
             			<% Form.find_all_by_survey_id(@survey.id).each do |form| %>
                           <% @usranswer +=  form.user_answers.find_all_by_answer_id(answer.id).count; %>