Workspace/Encuesta-Projekt/app/controllers/answers_controller.rb

  def create

	if params[:answer]
		@answer = Question.find(params[:question_id]).answers.create(params[:answer])

		question_id = Question.find(params[:question_id])
		survey_id = Survey.find(params[:survey_id])

		@answer.answertype = Answertype.find(params[:answertype])

		if @answer.save
---
INSERT INTO "answers" ("answertext", "question_id", "answertype_id", "created_at", "updated_at") VALUES ('Rot', 1, NULL, '2011-02-24 14:03:28.547200', '2011-02-24 14:03:28.547200')
SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 15) ORDER BY surveys.created_at DESC LIMIT 1
SELECT "answertypes".* FROM "answertypes" WHERE ("answertypes"."id" = 0) LIMIT 1
UPDATE "answers" SET "answertype_id" = 1, "updated_at" = '2011-02-24 14:14:24.429200' WHERE ("answers"."id" = 2)

 def edit
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE ("answers"."id" = 16) LIMIT 1

  def update
  	@answer = Answer.find(params[:id])


    if @answer.update_attributes(params[:answer])
---
SELECT "answers".* FROM "answers" WHERE ("answers"."id" = 16) LIMIT 1
UPDATE "answers" SET "answertext" = 'Pop', "updated_at" = '2011-03-03 11:50:17.267000' WHERE ("answers"."id" = 17)