Workspace/Encuesta-Projekt/app/controllers/evaluation_controller.rb

SELECT "questions".* FROM "questions" WHERE ("questions"."servayid" = '2')
SELECT "user_answers".* FROM "user_answers" WHERE ("user_answers".form_id = 85) AND ("user_answers"."answer_id" = 65)
---
	def show
		#survey = Survey.find(params[:id])
		q = Question.where(:servayid => params[:id])
		q.each do |question|
			#Umfragename ausgeben
			render :text =>  survay.name
			#Frage wird ausgegeben
			render :text =>  question.questiontext

			a = Answer.where(:question.id => question.id)