Workspace/Encuesta-Projekt/app/controllers/forms_controller.rb

      if @form.save
        flash[:success] = "Umfrage vollendet"

        Question.find_all_by_survey_id(params[:survey_id]).each do |question|
          Answer.find_all_by_question_id(question.id).each do |answer|
---
SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 2)
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 5)