Workspace/Encuesta-Projekt/app/controllers/forms_controller.rb

INSERT INTO "forms" ("survey_id", "created_at", "updated_at") VALUES (2, '2011-03-22 14:21:54.070600', '2011-03-22 14:21:54.070600')
SELECT "forms".* FROM "forms" WHERE ("forms"."id" = 40) LIMIT 1
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 2) ORDER BY surveys.created_at DESC LIMIT 1
---
  def create
    #render :text => params.inspect
    if params[:commit]
      @form = Survey.find(params[:survey_id]).forms.create(params[:form])

INSERT INTO "user_answers" ("AnswerBoolean", "AnswerText", "AnswerRate", "answer_id", "form_id", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, 40, '2011-03-22 18:38:16.438200', '2011-03-22 18:38:16.438200')
SELECT "answers".* FROM "answers" WHERE ("answers"."id" = 6) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "user_answers" SET "answer_id" = 6, "AnswerText" = 'Blablub', "updated_at" = '2011-03-22 20:24:00.117600' WHERE ("user_answers"."id" = 49)
---
            #dies ist eine Checkbox mit ja
              if v.to_i != 0
              #puts k
              @usranswer = Form.find(@form.id).user_answers.create()
              @usranswer.answer = Answer.find(k)
              @usranswer.save