Workspace/Encuesta-Projekt/app/controllers/surveys_controller.rb

  def show
    #Testshow für die Surveys.. zeigt den im Cookie gespeicherten Id-Wert an
    #render :text=> cookies[:surveyid]
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 5) ORDER BY surveys.created_at DESC LIMIT 1

  def create
    @survey = current_user.surveys.build(params[:survey])
    #@survey.gesperrt = params[:survey][:gesperrt]
    @survey.gesperrt = false
    # Statt den übergebenen Parameter zu übernehmen wird hier als Standart erst einmal immer eine Advanced-Umfrage generiert
    # Grund ist der zu hohe Zeitaufwand für die Differenzierung
    #@survey.surveytype = Surveytype.find(params[:survey][:surveytype])
    @survey.surveytype = Surveytype.find(2)


    if @survey.save
---
SELECT "surveytypes".* FROM "surveytypes" WHERE ("surveytypes"."id" = 1) LIMIT 1
INSERT INTO "surveys" ("bezeichnung", "gesperrt", "surveytype_id", "user_id", "created_at", "updated_at") VALUES ('Umfrage 1', NULL, NULL, 1, '2011-02-19 16:28:18.820000', '2011-02-19 16:28:18.820000')

  def edit
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 4) ORDER BY surveys.created_at DESC LIMIT 1

  def destroy
    @survey.destroy
---
DELETE FROM "surveys" WHERE ("surveys"."id" = 6)

  def update
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 2) ORDER BY surveys.created_at DESC LIMIT 1

  def lock
	@survey = Survey.find(params[:id])
	@survey.gesperrt = true
	@survey.save!
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 1) ORDER BY surveys.created_at DESC LIMIT 1
UPDATE "surveys" SET "gesperrt" = 't', "updated_at" = '2011-03-23 21:57:57.514472' WHERE ("surveys"."id" = 1)