Workspace/Encuesta-Projekt/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
   def index
    @title = "All users"
    @users = User.all

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "vorname", "login", "passwort", "email", "created_at", "updated_at", "encrypted_passwort", "salt") VALUES ('Friedemann', 'Marvin', 'VanZan', NULL, 'marvin.friedemann@ewetel.net', '2011-02-14 08:36:01.219200', '2011-02-14 08:36:01.219200', '312bd1395390be1ebebe6088b70d36b1c64dcea286bb354cc1af5d633295730f', 'c753d7f07a611401391ad6dd9d2698719a6f00c653935246ed49368b1f8b090a')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "vorname" = 'Marv', "updated_at" = '2011-02-16 12:19:38.246216' WHERE ("users"."id" = 1)
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])