Workspace/Encuesta-Projekt/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."login" IS NULL) LIMIT 1
---
  def edit
    #@user =User.find(params[:id])
    @user = User.find_by_login(params[:login])