trunk/Workspace/Encuesta-Projekt/app/views/surveys/_survey.html.erb

SELECT "forms".* FROM "forms" WHERE ("forms"."survey_id" = 1)
---
  	 		<% else %>
  	 		<%= Form.find_all_by_survey_id(survey.id).count%> Teilnahmen