trunk/Workspace/Encuesta-Projekt/app/views/surveys/edit.html.erb

   <!--  Da die Abgrenzung zwischen Simple und Advanced-Umfrage zu zeitintensiv war, mussten wir uns für einen Standardwert
 	   entscheiden und legen immer für jede Umfrage diesen Fest (momentan macht es keinen Unterschied).
 	   <% Surveytype.all.each do |surveytype| %>
---
SELECT "surveytypes".* FROM "surveytypes"


    <% Question.find_all_by_survey_id(@survey.id).each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 9)


    	<% Answer.find_all_by_question_id(question.id).each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 1)