trunk/Workspace/Encuesta-Projekt/app/views/surveys/show.html.erb


    <% surveytype = Surveytype.find(@survey.surveytype.id)%>
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 5) ORDER BY surveys.created_at DESC LIMIT 1
SELECT "surveytypes".* FROM "surveytypes" WHERE ("surveytypes"."id" = 1) LIMIT 1


    <% Question.find_all_by_survey_id(@survey.id).each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE ("questions"."survey_id" = 5)

    <br>
    	<% Answer.find_all_by_question_id(question.id).each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 5)