trunk/Workspace/Encuesta-Projekt/app/controllers/evaluation_controller.rb

  def show
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 17) ORDER BY surveys.created_at DESC LIMIT 1