trunk/Workspace/Encuesta-Projekt/app/controllers/questions_controller.rb

INSERT INTO "questions" ("questiontext", "survey_id", "created_at", "updated_at") VALUES ('Wie gehts?', 16, '2011-02-24 08:35:17.737800', '2011-02-24 08:35:17.737800')
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 16) ORDER BY surveys.created_at DESC LIMIT 1
SELECT "answertypes".* FROM "answertypes" WHERE ("answertypes"."id" = 1) LIMIT 1
---
  def create

    #@question = current_survey.questions.build(params[:question])

    @question = Survey.find(params[:survey_id]).questions.create(params[:question])

    surveyid = Survey.find(params[:survey_id]).id

    answertype = Answertype.find(params[:answertype])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 5) LIMIT 1
---
  def edit
    @question = Question.find(params[:id])

SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 5) LIMIT 1
SELECT "answertypes".* FROM "answertypes" WHERE ("answertypes"."id" = 1) LIMIT 1
SELECT "answers".* FROM "answers" WHERE ("answers"."question_id" = 'id')
DELETE FROM "answers" WHERE (question_id = @question.id)
---
  def update
    @question = Question.find(params[:id])

    survey = Survey.find(params[:survey_id])

    answertype = Answertype.find(params[:answertype])
    #cookies[:answertype] = answertype.id
    #cookies[:questionid] = @question.id

    #Answer.delete_all( "question_id = ")

    Answer.find_all_by_question_id(@question.id).each do |answer|
      Answer.destroy(answer.id)