Workspace/Encuesta-Projekt/app/views/shared/_survey_form.html.erb

  <div class="field">
    <% Surveytype.all.each do |surveytype| %>
---
SELECT "surveytypes".* FROM "surveytypes"