Workspace/Encuesta-Projekt/app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "surveys" WHERE ("surveys".user_id = 1)
---
    <span class="survey">
      <%= pluralize(current_user.surveys.count, "Umfrage(n)")