Workspace/Encuesta-Projekt/app/views/pages/help.html.erb


<%= collection_select(:user, :user_id, User.all, :id, :login) %>
---
SELECT "users".* FROM "users"

  <% end %>
  <% Surveytype.all.each do |surveytype| %>
---
SELECT "surveytypes".* FROM "surveytypes"


<% Survey.all.each do |survey| %>
---
SELECT "surveys".* FROM "surveys" ORDER BY surveys.created_at DESC